Revit 2027 API
ExportDWGSettings.SetDWGExportOptions Method
 Sets the options stored in these settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDWGExportOptions(
	DWGExportOptions options
)
Public Sub SetDWGExportOptions (
	options As DWGExportOptions
)
public:
void SetDWGExportOptions(
	DWGExportOptions^ options
)
member SetDWGExportOptions :
        options : DWGExportOptions -> unit
Parameters
options DWGExportOptions
 The options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportDWGSettings Class
Autodesk.Revit.DB Namespace